stm32duino/stm32_svd/svd/STM32WBAxx/STM32WBA25.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DLYBXS1</name>
      <description>DLYB address block description</description>
      <groupName>DLYB</groupName>
      <baseAddress>0x420CF000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DLYB_CR</name>
          <displayName>DLYB_CR</displayName>
          <description>DLYB control register</description>
          <addressOffset>0x000</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DEN</name>
              <description>Delay block enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>DLYB disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>DLYB enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEN</name>
              <description>Sampler length enable bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Sampler length and register access to UNIT[6:0] and SEL[3:0] disabled, output clock enabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Sampler length and register access to UNIT[6:0] and SEL[3:0] enabled, output clock disabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DLYB_CFGR</name>
          <displayName>DLYB_CFGR</displayName>
          <description>DLYB configuration register</description>
          <addressOffset>0x004</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>Phase for the output clock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNIT</name>
              <description>Delay of a unit delay cell.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNG</name>
              <description>Delay line length value
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LNGF</name>
              <description>Length valid flag
</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Length value in LNG is not valid.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Length value in LNG is valid.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="DLYBXS1">
      <name>SEC_DLYBXS1</name>
      <baseAddress>0x520CF000</baseAddress>
    </peripheral>
    <peripheral>
      <name>EXTI</name>
      <description>EXTI address block description</description>
      <groupName>EXTI</groupName>
      <baseAddress>0x46022000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x88</size>
        <usage>registers</usage>
      </addressBlock>
	  <interrupt>
        <name>PVD_AVD</name>
        <description>EXTI Line 16 interrupt Power Voltage Monitor/Analog Voltage Monitor</description>
        <value>1</value>
      </interrupt>
	  <interrupt>
        <name>EXTI1</name>
        <description>EXTI Line1 interrupt through EXTI[1]</description>
        <value>12</value>
      </interrupt>
	  <interrupt>
        <name>EXTI2</name>
        <description>EXTI Line2 interrupt through EXTI[2]</description>
        <value>13</value>
      </interrupt>
	  <interrupt>
        <name>EXTI3</name>
        <description>EXTI Line3 interrupt through EXTI[3]</description>
        <value>14</value>
      </interrupt>
	  <interrupt>
        <name>EXTI4</name>
        <description>EXTI Line4 interrupt through EXTI[4]</description>
        <value>15</value>
      </interrupt>
	  <interrupt>
        <name>EXTI5</name>
        <description>EXTI Line5 interrupt through EXTI[5]</description>
        <value>16</value>
      </interrupt>
	  <interrupt>
        <name>EXTI6</name>
        <description>EXTI Line6 interrupt through EXTI[6]</description>
        <value>17</value>
      </interrupt>
	  <interrupt>
        <name>EXTI7</name>
        <description>EXTI Line7 interrupt through EXTI[7]</description>
        <value>18</value>
      </interrupt>
	  <interrupt>
        <name>EXTI8</name>
        <description>EXTI Line8 interrupt through EXTI[8]</description>
        <value>19</value>
      </interrupt>
	  <interrupt>
        <name>EXTI9</name>
        <description>EXTI Line9 interrupt through EXTI[9]</description>
        <value>20</value>
      </interrupt>
	  <interrupt>
        <name>EXTI10</name>
        <description>EXTI Line10 interrupt through EXTI[10]</description>
        <value>21</value>
      </interrupt>
	  <interrupt>
        <name>EXTI11</name>
        <description>EXTI Line11 interrupt through EXTI[11]</description>
        <value>22</value>
      </interrupt>
	  <interrupt>
        <name>EXTI12</name>
        <description>EXTI Line12 interrupt through EXTI[12]</description>
        <value>23</value>
      </interrupt>
	  <interrupt>
        <name>EXTI13</name>
        <description>EXTI Line13 interrupt through EXTI[13]</description>
        <value>24</value>
      </interrupt>
	  <interrupt>
        <name>EXTI14</name>
        <description>EXTI Line14 interrupt through EXTI[14]</description>
        <value>25</value>
      </interrupt>
	  <interrupt>
        <name>EXTI15</name>
        <description>EXTI Line15 interrupt through EXTI[15]</description>
        <value>26</value>
      </interrupt>
	  <interrupt>
        <name>FPU</name>
        <description>Floating point interrupt</description>
        <value>54</value>
      </interrupt>
      <registers>
        <register>
          <name>EXTI_RTSR1</name>
          <displayName>EXTI_RTSR1</displayName>
          <description>EXTI rising trigger selection register</description>
          <addressOffset>0x000</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RT0</name>
              <description>Rising trigger event configuration bit of configurable event input x</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT1</name>
              <description>Rising trigger event configuration bit of configurable event input x</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT2</name>
              <description>Rising trigger event configuration bit of configurable event input x</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT3</name>
              <description>Rising trigger event configuration bit of configurable event input x</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT4</name>
              <description>Rising trigger event configuration bit of configurable event input x</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT5</name>
              <description>Rising trigger event configuration bit of configurable event input x</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT6</name>
              <description>Rising trigger event configuration bit of configurable event input x</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT7</name>
              <description>Rising trigger event configuration bit of configurable event input x</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT8</name>
              <description>Rising trigger event configuration bit of configurable event input x</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT9</name>
              <description>Rising trigger event configuration bit of configurable event input x</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT10</name>
              <description>Rising trigger event configuration bit of configurable event input x</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT11</name>
              <description>Rising trigger event configuration bit of configurable event input x</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT12</name>
              <description>Rising trigger event configuration bit of configurable event input x</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT13</name>
              <description>Rising trigger event configuration bit of configurable event input x</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT14</name>
              <description>Rising trigger event configuration bit of configurable event input x</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT15</name>
              <description>Rising trigger event configuration bit of configurable event input x</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT16</name>
              <description>Rising trigger event configuration bit of configurable event input x</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT19</name>
              <description>Rising trigger event configuration bit of configurable event input xless thansup&gt;(1)less than/sup&gt;
</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Rising trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Rising trigger enabled (for event and interrupt) for input line</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT20</name>
              <description>Rising trigger event configuration bit of configurable event input xless thansup&gt;(1)less than/sup&gt;
</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Rising trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Rising trigger enabled (for event and interrupt) for input line</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI_FTSR1</name>
          <displayName>EXTI_FTSR1</displayName>
          <description>EXTI falling trigger selection register</description>
          <addressOffset>0x004</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FT0</name>
              <description>Falling trigger event configuration bit of configurable event input x</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FT1</name>
              <description>Falling trigger event configuration bit of configurable event input x</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FT2</name>
              <description>Falling trigger event configuration bit of configurable event input x</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FT3</name>
              <description>Falling trigger event configuration bit of configurable event input x</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FT4</name>
              <description>Falling trigger event configuration bit of configurable event input x</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FT5</name>
              <description>Falling trigger event configuration bit of configurable event input x</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FT6</name>
              <description>Falling trigger event configuration bit of configurable event input x</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FT7</name>
              <description>Falling trigger event configuration bit of configurable event input x</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FT8</name>
              <description>Falling trigger event configuration bit of configurable event input x</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FT9</name>
              <description>Falling trigger event configuration bit of configurable event input x</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FT10</name>
              <description>Falling trigger event configuration bit of configurable event input x</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FT11</name>
              <description>Falling trigger event configuration bit of configurable event input x</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FT12</name>
              <description>Falling trigger event configuration bit of configurable event input x</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FT13</name>
              <description>Falling trigger event configuration bit of configurable event input x</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FT14</name>
              <description>Falling trigger event configuration bit of configurable event input x</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FT15</name>
              <description>Falling trigger event configuration bit of configurable event input x</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FT16</name>
              <description>Falling trigger event configuration bit of configurable event input x</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FT19</name>
              <description>Falling trigger event configuration bit of configurable event input xless thansup&gt;(1)less than/sup&gt;
</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Falling trigger disabled (for event and Interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Falling trigger enabled (for event and Interrupt) for input line.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FT20</name>
              <description>Falling trigger event configuration bit of configurable event input xless thansup&gt;(1)less than/sup&gt;
</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Falling trigger disabled (for event and Interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Falling trigger enabled (for event and Interrupt) for input line.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
